-- Основы
	- Выявление закономерностей в данных
	
-- Анализы
	1. Описательный (понять закономерности на основе существующих данных)
	2. Предиктивный (прогноз на будущее)
	3. Кластерный (как строки влияют друг дна друга)
	4. Анализ путей влияния (как столбцы таблицы влияют друг на друга)
	5. Деревья решений
	6. Прогнозирование временных рядов
	7. Ассоциативные правила
	8. Анализ цепочки последовательности
	
-- Web Mining 
	- Data Minig для Web, кроме того, что он работает с неструктурированной информацией
	
	-- Направления:
		1. Поиск информации
		2. Анализ структуры сегментов сети
		3. Выявление знаний из веб-ресурсов
		4. Персональзация информации