-- ѕлюсы:
	- Cокращаетс€ объем дискового пространства, необходимого дл€ хранени€ резервных копий
	- Cнижаютс€ требовани€ к пропускной способности сети в процессе перемещени€ резервных копий из одного места в другое,
	- ѕроцедуры резервного копировани€ выполн€ютс€ быстрее
	- ѕри использовании сжатых резервных копий быстрее завершаетс€ восстановление данных
-- ћинусы:
	- ≈сли база данных содержит предварительно сжатые данные (например, файлы в формате BLOB, такие, как. pdf и. jpg),
	  описанные выше достоинства нередко значительно уменьшаютс€ и даже практически сход€т на нет.
	-  роме того, при получении сжатых резервных копий возникает дополнительна€ нагрузка на процессор, что может, к примеру,
	  обернутьс€ серьезной проблемой в среде SharePoint.