- Какое основное приложение используется для работы с SQL Server
- На каком порту по-умолчанию работает SQL Server?
- Где производится настройка портов SQL Server?
- Каким инструментом можно отслеживать активность в SQL Server начиная с 2008 версии
- Как узнать версию SQL Server
- Какие 3 типа backup бывают и чем они отличаются
- Какие режимы аутентификации используются в SQL Server и где их можно поменять
- Что такое и зачем используется SQL Server Agent
- Что такое и зачем используется SQL Profiler
- Как посмотреть лог ошибок SQL Server
- Какие системные БД существуют и для чего они используются
- Что такое индекс
- Что такое OLTP
- Что такое статистика и для чего она используется
- Разница между DELETE и TRUNCATE таблицы
- В чём отличие кластерного и некластерного индекса?
- Почему для БД так важен LOG файл
- Какие существуют средства мониторинга производительности SQL Server?


- Как выставить максимальное количество памяти для SQL Server
- Что необходимо уточнить у заказчика для корректной установки SQL Server
- Что такое deadlock

-